{
"category":[
    {"RPG":"<h2>Role playing games</h2><p>A role-playing game (sometimes spelled roleplaying game; abbreviated RPG) is a game in which players assume the roles of characters in a fictional setting. Players take responsibility for acting out these roles within a narrative, either through literal acting, or through a process of structured decision-making regarding character development.Actions taken within many games succeed or fail according to a formal system of rules and guidelines.</p><p>There are several forms of role-playing games. The original form, sometimes called the tabletop role-playing game (TRPG), is conducted through discussion, whereas in live action role-playing (LARP), players physically perform their characters' actions.In both of these forms, an arranger called a game master (GM) usually decides on the rules and setting to be used, while acting as the referee; each of the other players takes on the role of a single character.</p><p>Several varieties of RPG also exist in electronic media, such as multiplayer text-based Multi-User Dungeons (MUDs) and their graphics-based successors, massively multiplayer online role-playing games (MMORPGs). Role-playing games also include single-player role-playing video games in which players control a character, or team of characters, who undertake(s) quests, and may include player capabilities that advance using statistical mechanics. These electronic games sometimes share settings and rules with tabletop RPGs, but emphasize character advancement more than collaborative storytelling.</p><p>This type of game is well-established, so some RPG-related game forms, such as trading/collectible card games (CCGs) and wargames, may not be included under the definition. Some amount of role-playing activity may be present in such games, but it is not the primary focus.The term role-playing game is also sometimes used to describe games involving roleplay simulation and exercises used in teaching, training, and academic research.</p>"},
    {"FPS":"<h2>First Person Shooter</h2><p>First-person shooter (FPS) is a video game genre centered on gun and other weapon-based combat in a first-person perspective; that is, the player experiences the action through the eyes of the protagonist. The genre shares common traits with other shooter games, which in turn makes it fall under the heading action game. Since the genre's inception, advanced 3D and pseudo-3D graphics have challenged hardware development, and multiplayer gaming has been integral.</p><p>The first-person shooter genre has been traced as far back as Maze War, development of which began in 1973, and 1974's Spasim. Later, and after more playful titles like MIDI Maze in 1987, the genre coalesced into a more violent form with 1992's Wolfenstein 3D, which has been credited with creating the genre's basic archetype upon which subsequent titles were based. One such title, and the progenitor of the genre's wider mainstream acceptance and popularity, was Doom, one of the most influential games in this genre; for some years, the term Doom clone was used to designate this genre due to Doom's influence.[1] Corridor shooter was another common name for the genre in its early years, since processing limitations of the era's hardware meant that most of the action in the games had to take place in enclosed areas.</p>"},
    {"Racing":"<h2>Racing</h2><p>In sport, racing is a competition of speed, against an objective criterion, usually a clock or to a specific point. The competitors in a race try to complete a given task in the shortest amount of time. Typically this involves traversing some distance, but it can be any other task involving speed to reach a specific goal.</p><p>A race may be run continuously to finish or may be made of several segments called heats, stages or legs. A heat is usually run over the same course at different times. A stage is a shorter section of a much longer course or a time trial.</p><p>The racing video game genre is the genre of video games, either in the first-person or third-person perspective, in which the player partakes in a racing competition with any type of land, water, air or space vehicles. They may be based on anything from real-world racing leagues to entirely fantastical settings. In general, they can be distributed along a spectrum anywhere between hardcore simulations, and simpler arcade racing games. Racing games may also fall under the category of sports games.</p>"},
    {"FTP":"<h2>Free to play</h2><p>Free-to-play (F2P or FtP) video games, also known as free-to-start,[1] are games that give players access to a significant portion of their content without paying. Free-to-play can be contrasted with pay to play, in which payment is required before using a service for the first time.</p><p>There are several kinds of free-to-play business models. The most common is based on the freemium software model; thus, free-to-play games are oftentimes not entirely free. For freemium games, users are granted access to a fully functional game but must pay microtransactions to access additional content. Another method of generating revenue is to integrate advertisements into the game.</p><p>The model was first popularly used in early massively multiplayer online games targeted towards casual gamers, before finding wider adoption among games released by major video game publishers to combat video game piracy and high system requirements.</p>"}
]
}
